<html xmlns:xs="http://www.w3.org/2001/XMLSchema" lang="FR">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Canal MonDossierWeb</title>
      <link rel="stylesheet" href="http://www.esup-portail.org/consortium/espace/docbook/esup.css" type="text/css">
      <meta name="generator" content="DocBook ESUP XSL Stylesheets V1.0">
   </head>
   <body>
      <div class="pagetitleborder"><span class="pagetitle">Canal MonDossierWeb</span><br><span class="pagesubtitle">Utilisation</span><br></div>
      <div class="index">
         <dl>
            <dt><span class="sectionmenu"><a href="#1">1.  G&eacute;n&eacute;ralit&eacute;s</a></span></dt>
            <dt><span class="sectionmenu"><a href="#2">2.  Etat-civil</a></span></dt>
            <dt><span class="sectionmenu"><a href="#3">3.  Adresses</a></span></dt>
            <dt><span class="sectionmenu"><a href="#4">4.  Inscriptions</a></span></dt>
            <dt><span class="sectionmenu"><a href="#5">5.  Calendrier des examens</a></span></dt>
            <dt><span class="sectionmenu"><a href="#6">6.  Notes et r&eacute;sultats</a></span></dt>
            <dt><span class="sectionmenu"><a href="#7">7.  Calendrier de rentr&eacute;e</a></span></dt>
            <dt><span class="sectionmenu"><a href="#8">8.  Extension</a></span></dt>
         </dl>
      </div><a name="1"></a>
          
      <h1>1.  G&eacute;n&eacute;ralit&eacute;s</h1>
      
          
      <p>Les diff&eacute;rentes rubriques du canal sont accessibles via les liens du
         bandeau sup&eacute;rieur. Deux liens suppl&eacute;mentaires peuvent &eacute;galement &ecirc;tre
             pr&eacute;sents si la configuration du canal le permet :
         <div>
            <ul>
               <li>
                            
                  <p>Un lien "Nous contacter", permettant &agrave; l'&eacute;tudiant de contacter
                               la scolarit&eacute; pour lui poser d'&eacute;ventuelles questions relatives &agrave; son
                               dossier
                  </p>
                          
               </li>
               <li>
                            
                  <p>Un lien "Afficher mon identit&eacute;", pr&eacute;sentant un r&eacute;sum&eacute; de
                               l'identit&eacute; de l'&eacute;tudiant dans chacune des rubriques. Cette
                               fonctionnalit&eacute; peut &ecirc;tre utile lors de l'impression du
                               dossier
                  </p>
                          
               </li>
            </ul>
         </div>
      </p>
        <a name="2"></a>
          
      <h1>2.  Etat-civil</h1>
      
          
      <p>Il pr&eacute;sente les informations g&eacute;n&eacute;rales de l'&eacute;tudiant (num&eacute;ro NNE,
             nom, date de naissance, etc.), sa premi&egrave;re inscription en Universit&eacute; ainsi
             que les informations relatives &agrave; l'obtention du bac.
      </p>
        <a name="3"></a>
          
      <h1>3.  Adresses</h1>
      
          
      <p>Sont ici pr&eacute;sent&eacute;es l'adresses fixe et l'adresse annuelle de
             l'&eacute;tudiant.
      </p>
        <a name="4"></a>
          
      <h1>4.  Inscriptions</h1>
      
          
      <p>Les inscriptions regroupent le cursus de l'&eacute;tudiant au sein de
             l'Universit&eacute; ainsi que son parcours dans les autres &eacute;tablissements de
             l'Enseignement sup&eacute;rieur.
      </p>
        <a name="5"></a>
          
      <h1>5.  Calendrier des examens</h1>
      
          
      <p>Il pr&eacute;sente les horaires (date, heure, dur&eacute;e) et lieux (b&acirc;timent,
             salle) d'examens.
      </p>
      
          
      <p>On affiche que les calendriers dont le nom dans le r&eacute;f&eacute;rentiel
             Apog&eacute;e commence par @ (seule m&eacute;thode trouv&eacute;e pour l'instant pour
             reconna&icirc;tre les calendriers &agrave; publier).
      </p>
      
          
      <p>Concernant le plugin CalExam, on affiche les calendriers d&eacute;finis et
             publi&eacute;s &agrave; travers les traitements personnalis&eacute;s d'APOGEE : Il s'agit d'une
             entr&eacute;e de menu que l'AMUE pr&eacute;voit dans son logiciel APOGEE pour permettre
             aux &eacute;tablissements d'int&eacute;grer leurs developpements internes.
             L'installation de ces traitements personnalis&eacute;s est d&eacute;crite dans le
             r&eacute;pertoire <span class="filename">oracle</span> du plugin
             <span class="emphasis">CalExam.</span></p>
        <a name="6"></a>
          
      <h1>6.  Notes et r&eacute;sultats</h1>
      
          
      <p>Le premier &eacute;cran pr&eacute;sente les r&eacute;sultats aux dipl&ocirc;mes ainsi qu'aux
             diff&eacute;rentes &eacute;tapes. Un clic sur leur code ou leur libell&eacute; permet d'acc&eacute;der
             au d&eacute;tail des notes des &eacute;l&eacute;ments et &eacute;preuves.
      </p>
      
          
      <p>Le principe appliqu&eacute; est le suivant : 
         <div>
            <ul>
               <li>
                            
                  <p>Sont affich&eacute;es toutes les notes et r&eacute;sultats &agrave; l'&eacute;tat 'E' ou
                               'T' dans Apog&eacute;e pour les VDI, VET ou &eacute;l&eacute;ments
                  </p>
                          
               </li>
               <li>
                            
                  <p>Par d&eacute;faut, les notes des &eacute;preuves sont affich&eacute;es si le t&eacute;moin
                               "Modalit&eacute;s de contr&ocirc;le des connaissances" (dans l'&eacute;cran "Epreuve" du
                               domaine "Epreuve") d'Apog&eacute;e est coch&eacute; pour l'&eacute;preuve. L'affichage
                               prend &eacute;galement en compte l'&eacute;tat de l'ELP p&egrave;re : 
                     <div>
                        <ul>
                           <li>
                                              
                              <p>Si cet &eacute;tat vaut 'E' ou 'T', alors les notes seront
                                                 toujours visibles
                              </p>
                                            
                           </li>
                           <li>
                                              
                              <p>S'il vaut 'A', seul le t&eacute;moin "Modalit&eacute;s de contr&ocirc;le des
                                                 connaissances" est pris en compte
                              </p>
                                            
                           </li>
                        </ul>
                     </div>
                  </p>
                          
               </li>
               <li>
                            
                  <p>Si l'&eacute;tat d'avancement de la VET est &agrave; 'A' (Session 0 = A ou
                               Session 1 et 2 = A / A, E / A ou T / A), l'avertissement suivant est
                               affich&eacute; sur la page des notes aux &eacute;l&eacute;ments et &eacute;preuves : "Notes
                               donn&eacute;es &agrave; titre informatif dans l'attente de la validation par le
                               jury de dipl&ocirc;me". Si l'&eacute;tat d'avancement est &agrave; 'E' ou 'T', rien
                               n'est affich&eacute;.
                  </p>
                          
               </li>
            </ul>
         </div>Bien s&ucirc;r, vous avez toujours la possibilit&eacute; de surcharger
             ce comportement par d&eacute;faut pour impl&eacute;menter vos propres r&egrave;gles de
             gestion.
      </p>
      
          
      <p>Concernant le plugin Resultat, on affiche que les r&eacute;sultats de
             l'ann&eacute;e en cours en s'appuyant sur le module d'extraction APOGEE.
      </p>
        <a name="7"></a>
          
      <h1>7.  Calendrier de rentr&eacute;e</h1>
      
          
      <p>Il est uniquement disponible avec le plugin CalRent.</p>
      
          
      <p>Le calendrier de rentr&eacute;e s'appuie sur le module d'extraction
             APOGEE.
      </p>
      
          
      <p>Voir le r&eacute;pertoire <span class="filename">oracle</span> dans le plugin
             CalRent.
      </p>
        <a name="8"></a>
          
      <h1>8.  Extension</h1>
      
          
      <p>Ce canal peut &eacute;galement &ecirc;tre utilis&eacute; en mode servant via la classe
             <span class="filename">MonDossierWebServant.java</span></p>
        
   </body>
</html>